app/controllers/movies_controller.rb

  def create
    @movie = Movie.create!(params[:movie])
---
INSERT INTO "movies" ("created_at", "description", "director", "rating", "release_date", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def similar
    @movie = Movie.find(params[:id])

    if @movie.director and !@movie.director.empty?
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'test'